package f_OOP2;

public class OOP2_Basic {
	public static void main(String[] args) {
		/*
		1. 상속 (~은 ~이다) : is a
		  - 기존 클래스를 재사용하여 새로운 클래스를 작성한다.
		  - 적은 양의 코드로 새로운 클래스를 작성할 수 있다.
		  - 새로 작성하고자 하는 클래스의 뒤에 상속받고자 하는 클래스의 이름을 키워드 'extends'와 함께 써주기만 하면 된다.
		  
		  class Parent{}	부모 클래스 없이는 자식 클래스가 존재할 수 없다.
		  class Child extends Parent{} 
		  - 상속해주는 클래스를 '조상클래스', 상속받는 클래스를 '자손클래스'라 한다.
		    : 조상클래스 - 부모클래스, 상위클래스, 기반클래스
		    : 자손클래스 - 자식클래스, 하위클래스, 파생된클래스
		    
		  - 멤버만 상속된다.
		  - 자손클래스의 멤버 갯수는 조상클래스보다 항상 같거나 많다.
		  
		2. 포함 (~은 ~을 포함하고 있다) : has a
		  - 상속 이외에 클래스를 재사용하는 또다른 방법
		  - 한 클래스의 멤버변수로 다른 클래스를 선언하는 방법이다.
		
		
		
		 */
		
		
		
		
		
		
	}
}
