package b_operation;

public class Operation_01 {
	public static void main(String[] args) {
		/*
		 1. 연산자 기본
		  - 단항연산자
		    : ++, --, +, -, ~, !, (타입)
		  - 이항연산자
		    : 산술연산자 => +, -, *, /, %, <<, >>, >>>
		    : 비교연산자 => <, >, <=, >=, ==, !=, instanceof
		    : 논리연산자 => &, |, ^, &&, ||
		  - 삼항연산자
		    : 연산결과 ? true일때 : false일때
		    
		  - 대입연산자
		    : =, op=
		 
		 2. 연산우선순위
		  - 단항 > 이항 > 삼항
		  - 산술 > 비교 > 대입
		  - 단항연산자와 비교연산자를 제외한 모든 연산의 순서는 왼쪽에서 오른쪽이다.
		 
		 
		 */
		
		
		
		
	}
}
